CPS-Projet/tests/tPersonnage.org
* Test Personnage

** Cas de test 1.1 : Personnage::testInit
*** Condition initiale : ∅
*** Operation : L0 =(def) init("Alex", 15, 50, 10, 100, 1664)
*** Oracle :
**** nom(L0) = "Alex"
**** largeur(L0) = 15
**** hauteur(L0) = 50
**** profondeur(L0) = 10
**** force(L0) = 100
**** pointDeVie(L0) = 1664
**** sommeArgent(L0) = 0
**** estEquipe(L0) = false
**** bonus(L0) = 100
**** estPorte(L0) = false


** Cas de test 1.2 : Personnage::testInitFail1
*** Condition initiale : ∅
*** Operation : L0 =(def) init("Alex", -15, 50, 10, 100, 1664)
*** Oracle :
**** -15 < 0
**** #exception levee

** Cas de test 1.3 : Personnage::testInitFail2
*** Condition initiale : ∅
*** Operation : L0 =(def) init("Alex", 15, -50, 10, 100, 1664)
*** Oracle :
**** -50 < 0
**** #exception levee

** Cas de test 1.4 : ...




** Cas de test 2.1 : Personnage::retraitPdv
*** Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)
*** Operation : L0 =(def) retraitPdv(L, 50)
*** Oracle : 
**** pointsDeVie(L0) = pointsDeVie(L) - 50

** Cas de test 2.2 : Personnage::retraitPdvFail1
*** Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)
*** Operation : L0 =(def) retraitPdv(L, -50)
*** Oracle : 
**** -50 < 0
**** #exception levee




