CPS-Projet/tests/tex/tPersonnage.tex
% Created 2014-04-18 ven. 12:57
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{amssymb}
\usepackage{hyperref}


\title{TPersonnage}
\author{Kevin Coquart, Quentin Bunel}
\date{18 avril 2014}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{Test Personnage}
\label{sec-1}


\subsection{Cas de test 1.1 : Personnage::testInit}
\label{sec-1.1}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.1.1}

\subsubsection{Operation : L0 =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.1.2}

\subsubsection{Oracle :}
\label{sec-1.1.3}

\begin{itemize}

\item nom(L0) = "Alex"\\
\label{sec-1.1.3.1}


\item largeur(L0) = 15\\
\label{sec-1.1.3.2}


\item hauteur(L0) = 50\\
\label{sec-1.1.3.3}


\item profondeur(L0) = 10\\
\label{sec-1.1.3.4}


\item force(L0) = 100\\
\label{sec-1.1.3.5}


\item pointDeVie(L0) = 1664\\
\label{sec-1.1.3.6}


\item sommeArgent(L0) = 0\\
\label{sec-1.1.3.7}


\item estEquipe(L0) = false\\
\label{sec-1.1.3.8}


\item bonus(L0) = 100\\
\label{sec-1.1.3.9}


\item estPorte(L0) = false\\
\label{sec-1.1.3.10}



\end{itemize} % ends low level
\subsection{Cas de test 1.2 : Personnage::testInitFail1}
\label{sec-1.2}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.2.1}

\subsubsection{Operation : L0 =(def) init("Alex", -15, 50, 10, 100, 1664)}
\label{sec-1.2.2}

\subsubsection{Oracle :}
\label{sec-1.2.3}

\begin{itemize}

\item -15 < 0\\
\label{sec-1.2.3.1}


\item \#exception levee\\
\label{sec-1.2.3.2}


\end{itemize} % ends low level
\subsection{Cas de test 1.3 : Personnage::testInitFail2}
\label{sec-1.3}

\subsubsection{Condition initiale : $\varnothing$}
\label{sec-1.3.1}

\subsubsection{Operation : L0 =(def) init("Alex", 15, -50, 10, 100, 1664)}
\label{sec-1.3.2}

\subsubsection{Oracle :}
\label{sec-1.3.3}

\begin{itemize}

\item -50 < 0\\
\label{sec-1.3.3.1}


\item \#exception levee\\
\label{sec-1.3.3.2}


\end{itemize} % ends low level
\subsection{Cas de test 1.4 : \ldots{}}
\label{sec-1.4}





\subsection{Cas de test 2.1 : Personnage::retraitPdv}
\label{sec-1.5}

\subsubsection{Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.5.1}

\subsubsection{Operation : L0 =(def) retraitPdv(L, 50)}
\label{sec-1.5.2}

\subsubsection{Oracle :}
\label{sec-1.5.3}

\begin{itemize}

\item pointsDeVie(L0) = pointsDeVie(L) - 50\\
\label{sec-1.5.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 2.2 : Personnage::retraitPdvFail1}
\label{sec-1.6}
