CPS-Projet/tests/html/tPersonnage.html



<div id="outline-container-1.6.1" class="outline-4">

<h4 id="sec-1.6.1"><span class="section-number-4">1.6.1</span> Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664) </h4>

<div class="outline-text-4" id="text-1.6.1">



</div>



</div>



<div id="outline-container-1.6.2" class="outline-4">

<h4 id="sec-1.6.2"><span class="section-number-4">1.6.2</span> Operation : L0 =(def) retraitPdv(L, -50) </h4>

<div class="outline-text-4" id="text-1.6.2">



</div>



</div>



<div id="outline-container-1.6.3" class="outline-4">

<h4 id="sec-1.6.3"><span class="section-number-4">1.6.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.6.3">



<ul>

<li id="sec-1.6.3.1">-50 &lt; 0 <br/>

</li>

<li id="sec-1.6.3.2">#exception levee <br/>









</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.7" class="outline-3">

<h3 id="sec-1.7"><span class="section-number-3">1.7</span> Cas de test 3.1 : Personnage::depotPdv </h3>

<div class="outline-text-3" id="text-1.7">





</div>



<div id="outline-container-1.7.1" class="outline-4">

<h4 id="sec-1.7.1"><span class="section-number-4">1.7.1</span> Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664) </h4>

<div class="outline-text-4" id="text-1.7.1">



</div>



</div>



<div id="outline-container-1.7.2" class="outline-4">

<h4 id="sec-1.7.2"><span class="section-number-4">1.7.2</span> Operation : L0 =(def) depotPdv(L, 50) </h4>

<div class="outline-text-4" id="text-1.7.2">



</div>



</div>



<div id="outline-container-1.7.3" class="outline-4">

<h4 id="sec-1.7.3"><span class="section-number-4">1.7.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.7.3">



<ul>

<li id="sec-1.7.3.1">pointsDeVie(L0) = pointsDeVie(L) + 50 <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.8" class="outline-3">

<h3 id="sec-1.8"><span class="section-number-3">1.8</span> Cas de test 3.2 : Personnage::depotPdvFail1 </h3>

<div class="outline-text-3" id="text-1.8">





</div>



<div id="outline-container-1.8.1" class="outline-4">

<h4 id="sec-1.8.1"><span class="section-number-4">1.8.1</span> Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664) </h4>

<div class="outline-text-4" id="text-1.8.1">



</div>



</div>



<div id="outline-container-1.8.2" class="outline-4">

<h4 id="sec-1.8.2"><span class="section-number-4">1.8.2</span> Operation : L0 =(def) depotPdv(L, -50) </h4>

<div class="outline-text-4" id="text-1.8.2">



</div>



</div>



<div id="outline-container-1.8.3" class="outline-4">

<h4 id="sec-1.8.3"><span class="section-number-4">1.8.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.8.3">



<ul>

<li id="sec-1.8.3.1">-50 &lt; 0 <br/>

</li>

<li id="sec-1.8.3.2">#exception levee <br/>











</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.9" class="outline-3">

<h3 id="sec-1.9"><span class="section-number-3">1.9</span> Cas de test 4.1 : Personnage::retraitArgent </h3>

<div class="outline-text-3" id="text-1.9">





</div>



<div id="outline-container-1.9.1" class="outline-4">

<h4 id="sec-1.9.1"><span class="section-number-4">1.9.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.9.1">



<ul>

<li id="sec-1.9.1.1">L =(def) init("Alex", 15, 50, 10, 100, 1664) <br/>

</li>

<li id="sec-1.9.1.2">L0 =(def) depotArgent(L, 100) <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.9.2" class="outline-4">

<h4 id="sec-1.9.2"><span class="section-number-4">1.9.2</span> Operation : L1 =(def) retraitArgent(L0, 50) </h4>

<div class="outline-text-4" id="text-1.9.2">



</div>



</div>



<div id="outline-container-1.9.3" class="outline-4">

<h4 id="sec-1.9.3"><span class="section-number-4">1.9.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.9.3">



<ul>

<li id="sec-1.9.3.1">sommeArgent(L1) = sommeArgent(L0) - 50 <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.10" class="outline-3">

<h3 id="sec-1.10"><span class="section-number-3">1.10</span> Cas de test 4.2 : Personnage::retraitArgent </h3>

<div class="outline-text-3" id="text-1.10">





</div>



<div id="outline-container-1.10.1" class="outline-4">

<h4 id="sec-1.10.1"><span class="section-number-4">1.10.1</span> Condition initiale : </h4>

<div class="outline-text-4" id="text-1.10.1">



<ul>

<li id="sec-1.10.1.1">L =(def) init("Alex", 15, 50, 10, 100, 1664) <br/>

</li>

<li id="sec-1.10.1.2">L0 =(def) depotArgent(L, 50) <br/>

</li>

</ul>

</div>



</div>



<div id="outline-container-1.10.2" class="outline-4">

<h4 id="sec-1.10.2"><span class="section-number-4">1.10.2</span> Operation : L1 =(def) retraitArgent(L0, 50) </h4>

<div class="outline-text-4" id="text-1.10.2">



</div>



</div>



<div id="outline-container-1.10.3" class="outline-4">

<h4 id="sec-1.10.3"><span class="section-number-4">1.10.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.10.3">



<ul>

<li id="sec-1.10.3.1">sommeArgent(L1) = sommeArgent(L0) - 50 <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.11" class="outline-3">

<h3 id="sec-1.11"><span class="section-number-3">1.11</span> Cas de test 4.3 : Personnage::retraitArgentFail1 </h3>

<div class="outline-text-3" id="text-1.11">





</div>



<div id="outline-container-1.11.1" class="outline-4">

<h4 id="sec-1.11.1"><span class="section-number-4">1.11.1</span> Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664) </h4>

<div class="outline-text-4" id="text-1.11.1">



</div>



</div>



<div id="outline-container-1.11.2" class="outline-4">

<h4 id="sec-1.11.2"><span class="section-number-4">1.11.2</span> Operation : L0 =(def) retraitArgent(L, 50) </h4>

<div class="outline-text-4" id="text-1.11.2">



</div>



</div>



<div id="outline-container-1.11.3" class="outline-4">

<h4 id="sec-1.11.3"><span class="section-number-4">1.11.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.11.3">



<ul>

<li id="sec-1.11.3.1">50 &gt; sommeArgent(L) <br/>

</li>

<li id="sec-1.11.3.2">#exception levee <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.12" class="outline-3">

<h3 id="sec-1.12"><span class="section-number-3">1.12</span> Cas de test 4.4 : Personnage::retraitArgentFail1 </h3>

<div class="outline-text-3" id="text-1.12">





</div>



<div id="outline-container-1.12.1" class="outline-4">

<h4 id="sec-1.12.1"><span class="section-number-4">1.12.1</span> Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664) </h4>

<div class="outline-text-4" id="text-1.12.1">



</div>



</div>



<div id="outline-container-1.12.2" class="outline-4">

<h4 id="sec-1.12.2"><span class="section-number-4">1.12.2</span> Operation : L0 =(def) retraitArgent(L, -50) </h4>

<div class="outline-text-4" id="text-1.12.2">



</div>



</div>



<div id="outline-container-1.12.3" class="outline-4">

<h4 id="sec-1.12.3"><span class="section-number-4">1.12.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.12.3">



<ul>

<li id="sec-1.12.3.1">-50 &lt; 0 <br/>

</li>

<li id="sec-1.12.3.2">#exception levee <br/>









</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.13" class="outline-3">

<h3 id="sec-1.13"><span class="section-number-3">1.13</span> Cas de test 5.1 : Personnage::depotArgent </h3>

<div class="outline-text-3" id="text-1.13">





</div>



<div id="outline-container-1.13.1" class="outline-4">

<h4 id="sec-1.13.1"><span class="section-number-4">1.13.1</span> Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664) </h4>

<div class="outline-text-4" id="text-1.13.1">



</div>



</div>



<div id="outline-container-1.13.2" class="outline-4">

<h4 id="sec-1.13.2"><span class="section-number-4">1.13.2</span> Operation : L0 =(def) depotArgent(L, 50) </h4>

<div class="outline-text-4" id="text-1.13.2">



</div>



</div>



<div id="outline-container-1.13.3" class="outline-4">

<h4 id="sec-1.13.3"><span class="section-number-4">1.13.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.13.3">



<ul>

<li id="sec-1.13.3.1">sommeArgent(L0) = sommeArgent(L) + 50 <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.14" class="outline-3">

<h3 id="sec-1.14"><span class="section-number-3">1.14</span> Cas de test 5.2 : Personnage::depotArgentFail1 </h3>

<div class="outline-text-3" id="text-1.14">





</div>



<div id="outline-container-1.14.1" class="outline-4">

<h4 id="sec-1.14.1"><span class="section-number-4">1.14.1</span> Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664) </h4>

<div class="outline-text-4" id="text-1.14.1">



</div>



</div>



<div id="outline-container-1.14.2" class="outline-4">

<h4 id="sec-1.14.2"><span class="section-number-4">1.14.2</span> Operation : L0 =(def) depotArgent(L, -50) </h4>

<div class="outline-text-4" id="text-1.14.2">



</div>



</div>



<div id="outline-container-1.14.3" class="outline-4">

<h4 id="sec-1.14.3"><span class="section-number-4">1.14.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.14.3">



<ul>

<li id="sec-1.14.3.1">-50 &lt; 0 <br/>

</li>

<li id="sec-1.14.3.2">#exception levee <br/>







</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.15" class="outline-3">

<h3 id="sec-1.15"><span class="section-number-3">1.15</span> Cas de test 6.1 : Personnage::ramasser </h3>

<div class="outline-text-3" id="text-1.15">





</div>
