CPS-Projet/tests/tex/tPersonnage.tex

\subsubsection{Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.6.1}

\subsubsection{Operation : L0 =(def) retraitPdv(L, -50)}
\label{sec-1.6.2}

\subsubsection{Oracle :}
\label{sec-1.6.3}

\begin{itemize}

\item -50 < 0\\
\label{sec-1.6.3.1}


\item \#exception levee\\
\label{sec-1.6.3.2}





\end{itemize} % ends low level
\subsection{Cas de test 3.1 : Personnage::depotPdv}
\label{sec-1.7}

\subsubsection{Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.7.1}

\subsubsection{Operation : L0 =(def) depotPdv(L, 50)}
\label{sec-1.7.2}

\subsubsection{Oracle :}
\label{sec-1.7.3}

\begin{itemize}

\item pointsDeVie(L0) = pointsDeVie(L) + 50\\
\label{sec-1.7.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 3.2 : Personnage::depotPdvFail1}
\label{sec-1.8}

\subsubsection{Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.8.1}

\subsubsection{Operation : L0 =(def) depotPdv(L, -50)}
\label{sec-1.8.2}

\subsubsection{Oracle :}
\label{sec-1.8.3}

\begin{itemize}

\item -50 < 0\\
\label{sec-1.8.3.1}


\item \#exception levee\\
\label{sec-1.8.3.2}






\end{itemize} % ends low level
\subsection{Cas de test 4.1 : Personnage::retraitArgent}
\label{sec-1.9}

\subsubsection{Condition initiale :}
\label{sec-1.9.1}

\begin{itemize}

\item L =(def) init("Alex", 15, 50, 10, 100, 1664)\\
\label{sec-1.9.1.1}


\item L0 =(def) depotArgent(L, 100)\\
\label{sec-1.9.1.2}

\end{itemize} % ends low level
\subsubsection{Operation : L1 =(def) retraitArgent(L0, 50)}
\label{sec-1.9.2}

\subsubsection{Oracle :}
\label{sec-1.9.3}

\begin{itemize}

\item sommeArgent(L1) = sommeArgent(L0) - 50\\
\label{sec-1.9.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 4.2 : Personnage::retraitArgent}
\label{sec-1.10}

\subsubsection{Condition initiale :}
\label{sec-1.10.1}

\begin{itemize}

\item L =(def) init("Alex", 15, 50, 10, 100, 1664)\\
\label{sec-1.10.1.1}


\item L0 =(def) depotArgent(L, 50)\\
\label{sec-1.10.1.2}

\end{itemize} % ends low level
\subsubsection{Operation : L1 =(def) retraitArgent(L0, 50)}
\label{sec-1.10.2}

\subsubsection{Oracle :}
\label{sec-1.10.3}

\begin{itemize}

\item sommeArgent(L1) = sommeArgent(L0) - 50\\
\label{sec-1.10.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 4.3 : Personnage::retraitArgentFail1}
\label{sec-1.11}

\subsubsection{Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.11.1}

\subsubsection{Operation : L0 =(def) retraitArgent(L, 50)}
\label{sec-1.11.2}

\subsubsection{Oracle :}
\label{sec-1.11.3}

\begin{itemize}

\item 50 > sommeArgent(L)\\
\label{sec-1.11.3.1}


\item \#exception levee\\
\label{sec-1.11.3.2}


\end{itemize} % ends low level
\subsection{Cas de test 4.4 : Personnage::retraitArgentFail1}
\label{sec-1.12}

\subsubsection{Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.12.1}

\subsubsection{Operation : L0 =(def) retraitArgent(L, -50)}
\label{sec-1.12.2}

\subsubsection{Oracle :}
\label{sec-1.12.3}

\begin{itemize}

\item -50 < 0\\
\label{sec-1.12.3.1}


\item \#exception levee\\
\label{sec-1.12.3.2}





\end{itemize} % ends low level
\subsection{Cas de test 5.1 : Personnage::depotArgent}
\label{sec-1.13}

\subsubsection{Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.13.1}

\subsubsection{Operation : L0 =(def) depotArgent(L, 50)}
\label{sec-1.13.2}

\subsubsection{Oracle :}
\label{sec-1.13.3}

\begin{itemize}

\item sommeArgent(L0) = sommeArgent(L) + 50\\
\label{sec-1.13.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 5.2 : Personnage::depotArgentFail1}
\label{sec-1.14}

\subsubsection{Condition initiale :  L =(def) init("Alex", 15, 50, 10, 100, 1664)}
\label{sec-1.14.1}

\subsubsection{Operation : L0 =(def) depotArgent(L, -50)}
\label{sec-1.14.2}

\subsubsection{Oracle :}
\label{sec-1.14.3}

\begin{itemize}

\item -50 < 0\\
\label{sec-1.14.3.1}


\item \#exception levee\\
\label{sec-1.14.3.2}




\end{itemize} % ends low level
\subsection{Cas de test 6.1 : Personnage::ramasser}
\label{sec-1.15}
