CPS-Projet/tests/tPersonnage.org
**** estEquipe(L0) = true
**** laChoseEquipee(L0) = C


** Cas de test 6.2 : Personnage::ramasserFail1
*** Condition initiale :  
**** L =(def) init("Alex", 15, 50, 10, 100, 1664)
**** C =(def) ObjetEquipable
**** C2 =(def) ObjetEquipable
**** L0 =(def) ramasser(L, C)
*** Operation : L1 =(def) ramasser(L0, C2)
*** Oracle : 
**** estEquipe(L1) = true
**** #exception levee






** Cas de test 7.1 : Personnage::jeter
*** Condition initiale :  
**** L =(def) init("Alex", 15, 50, 10, 100, 1664)
**** C =(def) ObjetEquipable
**** L0 =(def) ramasser(L, C)
*** Operation : L1 =(def) jeter(L0)
*** Oracle : 
**** estEquipe(L1) = false

** Cas de test 7.2 : Personnage::jeterFail
*** Condition initiale :  
**** L =(def) init("Alex", 15, 50, 10, 100, 1664)
*** Operation : L1 =(def) jeter(L0)
*** Oracle : 
**** estEquipe(L) = false
**** #exception levee

