CPS-Projet/tests/tex/tPersonnage.tex

\subsubsection{Condition initiale :}
\label{sec-1.15.1}

\begin{itemize}

\item L =(def) init("Alex", 15, 50, 10, 100, 1664)\\
\label{sec-1.15.1.1}


\item C =(def) ObjetEquipable\\
\label{sec-1.15.1.2}

\end{itemize} % ends low level
\subsubsection{Operation : L0 =(def) ramasser(L, C)}
\label{sec-1.15.2}

\subsubsection{Oracle :}
\label{sec-1.15.3}

\begin{itemize}

\item estEquipe(L0) = true\\
\label{sec-1.15.3.1}


\item laChoseEquipee(L0) = C\\
\label{sec-1.15.3.2}



\end{itemize} % ends low level
\subsection{Cas de test 6.2 : Personnage::ramasserFail1}
\label{sec-1.16}

\subsubsection{Condition initiale :}
\label{sec-1.16.1}

\begin{itemize}

\item L =(def) init("Alex", 15, 50, 10, 100, 1664)\\
\label{sec-1.16.1.1}


\item C =(def) ObjetEquipable\\
\label{sec-1.16.1.2}


\item C2 =(def) ObjetEquipable\\
\label{sec-1.16.1.3}


\item L0 =(def) ramasser(L, C)\\
\label{sec-1.16.1.4}

\end{itemize} % ends low level
\subsubsection{Operation : L1 =(def) ramasser(L0, C2)}
\label{sec-1.16.2}

\subsubsection{Oracle :}
\label{sec-1.16.3}

\begin{itemize}

\item estEquipe(L1) = true\\
\label{sec-1.16.3.1}


\item \#exception levee\\
\label{sec-1.16.3.2}







\end{itemize} % ends low level
\subsection{Cas de test 7.1 : Personnage::jeter}
\label{sec-1.17}

\subsubsection{Condition initiale :}
\label{sec-1.17.1}

\begin{itemize}

\item L =(def) init("Alex", 15, 50, 10, 100, 1664)\\
\label{sec-1.17.1.1}


\item C =(def) ObjetEquipable\\
\label{sec-1.17.1.2}


\item L0 =(def) ramasser(L, C)\\
\label{sec-1.17.1.3}

\end{itemize} % ends low level
\subsubsection{Operation : L1 =(def) jeter(L0)}
\label{sec-1.17.2}

\subsubsection{Oracle :}
\label{sec-1.17.3}

\begin{itemize}

\item estEquipe(L1) = false\\
\label{sec-1.17.3.1}


\end{itemize} % ends low level
\subsection{Cas de test 7.2 : Personnage::jeterFail}
\label{sec-1.18}

\subsubsection{Condition initiale :}
\label{sec-1.18.1}

\begin{itemize}

\item L =(def) init("Alex", 15, 50, 10, 100, 1664)\\
\label{sec-1.18.1.1}

\end{itemize} % ends low level
\subsubsection{Operation : L1 =(def) jeter(L0)}
\label{sec-1.18.2}

\subsubsection{Oracle :}
\label{sec-1.18.3}

\begin{itemize}

\item estEquipe(L) = false\\
\label{sec-1.18.3.1}


\item \#exception levee\\
\label{sec-1.18.3.2}


\end{itemize} % ends low level

\end{document}
